In [2]:
import pandas as pd

In [4]:
student_list=[{'name':'John',
               'major':"computer science",
               'sex':"male"},
             {'name':'Nate',
               'major':"computer science",
               'sex':"male"},
             {'name':'Edward',
               'major':"computer science",
               'sex':"male"},
             {'name':'Zara',
               'major':"psychology",
               'sex':"female"},
             {'name':'John',
               'major':"computer science",
               'sex':"male"}]
df=pd.DataFrame(student_list,columns=['name','major','sex'])
df

     name             major     sex
0    John  computer science    male
1    Nate  computer science    male
2  Edward  computer science    male
3    Zara        psychology  female
4    John  computer science    male

In [5]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [8]:
df = df.drop_duplicates()

In [9]:
df

     name             major     sex
0    John  computer science    male
1    Nate  computer science    male
2  Edward  computer science    male
3    Zara        psychology  female

In [11]:
student_list=[{'name':'John',
               'major':"computer science",
               'sex':"male"},
             {'name':'Nate',
               'major':"computer science",
               'sex':"male"},
             {'name':'Edward',
               'major':"computer science",
               'sex':"male"},
             {'name':'Zara',
               'major':"psychology",
               'sex':"female"},
              {'name':'Wendy',
               'major':"economics",
               'sex':"female"},
              {'name':'Nate',
               'major':None,
               'sex':"male"},
             {'name':'John',
               'major':"economics",
               'sex':"male"}]
df=pd.DataFrame(student_list,columns=['name','major','sex'])
df

     name             major     sex
0    John  computer science    male
1    Nate  computer science    male
2  Edward  computer science    male
3    Zara        psychology  female
4   Wendy         economics  female
5    Nate              None    male
6    John         economics    male

In [12]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [13]:
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [14]:
df.drop_duplicates(['name'],keep='first')

     name             major     sex
0    John  computer science    male
1    Nate  computer science    male
2  Edward  computer science    male
3    Zara        psychology  female
4   Wendy         economics  female

In [15]:
student_list=[{'name':'John',
               'major':"computer science",
               'sex':"male"},
             {'name':'Nate',
               'major':"computer science",
               'sex':"male"},
             {'name':'Edward',
               'major':"computer science",
               'sex':"male"},
             {'name':'Zara',
               'major':"psychology",
               'sex':"female"},
              {'name':'Wendy',
               'major':"economics",
               'sex':"female"},
              {'name':'Nate',
               'major':None,
               'sex':"male"},
             {'name':'John',
               'major':"economics",
               'sex':"male"}]
df=pd.DataFrame(student_list,columns=['name','major','sex'])
df

     name             major     sex
0    John  computer science    male
1    Nate  computer science    male
2  Edward  computer science    male
3    Zara        psychology  female
4   Wendy         economics  female
5    Nate              None    male
6    John         economics    male

In [16]:
df.drop_duplicates(['name'],keep='last')

     name             major     sex
2  Edward  computer science    male
3    Zara        psychology  female
4   Wendy         economics  female
5    Nate              None    male
6    John         economics    male